<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"11f7593c813ce00a7e4755fc4031222d2b1ffe0cd8c316fca0b0548daf6f1b78","plan_job_ref":"Job Terraform Plan #16 at https://github.com/getsentry/secure-cloud-functions-template/actions/runs/15555652005","plan_out_hash":"dfeba993f6662fff1501f2f5ac2f8e856cd3df00ab733791668ce6c40c24a5a6","plan_hash":"7a0d16a1258aa69e711595e51f944c5ca1fa2157d634fb0223b568351bf693fb","plan_text_format":"diff","version":"1.48.0","closed":true} -->
Terraform plan in __.__
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.functions.module.cloud_function_gen2["get-gh-app-token"].google_cloudfunctions2_function.function will be updated in-place
!~  resource "google_cloudfunctions2_function" "function" {
        id               = "projects/jeffreyhung-test/locations/us-west1/functions/get-gh-app-token"
        name             = "get-gh-app-token"
#        (11 unchanged attributes hidden)

!~      build_config {
#            (7 unchanged attributes hidden)

!~          source {
!~              storage_source {
!~                  object     = "src-dfc0ff933c1092b4381fb05387439ead.zip" -> "src-f2ec688d46b8e4d3376b38e05871be13.zip"
#                    (2 unchanged attributes hidden)
                }
            }

#            (1 unchanged block hidden)
        }

#        (1 unchanged block hidden)
    }

  # module.functions.module.cloud_function_gen2["get-gh-app-token"].google_storage_bucket_object.zip must be replaced
-/+ resource "google_storage_bucket_object" "zip" {
+       content             = (sensitive value)
!~      crc32c              = "wvRnZQ==" -> (known after apply)
!~      detect_md5hash      = "38D/kzwQkrQ4H7BTh0OerQ==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1739379835317211 -> (known after apply)
!~      id                  = "********************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "38D/kzwQkrQ4H7BTh0OerQ==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-dfc0ff933c1092b4381fb05387439ead.zip?generation=1739379835317211&alt=media" -> (known after apply)
!~      name                = "src-dfc0ff933c1092b4381fb05387439ead.zip" -> "src-f2ec688d46b8e4d3376b38e05871be13.zip" # forces replacement
!~      output_name         = "src-dfc0ff933c1092b4381fb05387439ead.zip" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-dfc0ff933c1092b4381fb05387439ead.zip" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform Apply #39](https://github.com/getsentry/secure-cloud-functions-template/actions/runs/21533410198)